docs/posts/2015-08-13-go-to-your-pastor-for-depression.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Mar 29, 2025 13:16 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Go to Your Pastor for Depression?</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link href='/pagefind/pagefind-ui.css' rel='stylesheet'>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Go to Your Pastor for Depression?</h1>
<p class="subtitle" role="doc-subtitle">Aug 13, 2015 00:00</p>
</header><p>
Glennon Doyle Melton at <a href="http://momastery.com/blog/">momastery.com</a> posted an article with the provocative title, &ldquo;<a href="http://momastery.com/blog/2015/08/12/ministers-depression/?utm_content=bufferff8d8&amp;utm_medium=social&amp;utm_source=twitter.com&amp;utm_campaign=buffer">If You Wouldn’t Go to Your Minister for a Mammogram, Don’t Go for Depression</a>.&rdquo; In it, she makes the important point that there are those in Christian communities that advocate treatment of depression through prayer alone, refusing to see it as a medical condition, yet those same people would not treat cancer simply with prayer. In this, I wholeheartedly agree. Ministers harm those whom they counsel when they do not urge them to seek medical help for mental illness.
</p>

<p>
At the same time, though, I think the title of the post does a disservice to those who might read it. First, recognize that the analogy is particularly weak. Depression is a condition, a mammogram is a diagnostic tool. A better analogy would be this, &ldquo;If you wouldn&rsquo;t go to your minister because you have cancer, don&rsquo;t go because you have depression.&rdquo; So, the question, then, should be &ldquo;Would you go to your minister if you had cancer?&rdquo; I certainly hope that the answer is yes; cancer may not be a spiritual condition, but surely having cancer affects one&rsquo;s spirit, and the patient should get as much support as she can. In the same way, having depression affects one&rsquo;s spirit, and support from a caring pastoral counselor should be valued.
</p>

<p>
Is pastoral counseling good treatment for the depression itself? No, but then again, neither is a mammogram good treatment for cancer.
</p>


<div class="tagline" id="org5a1d0e9">
<p>
Tagged: <a href="../tags/critical-thinking.html">Critical-Thinking</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Mar 29, 2025 13:16.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
